In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(r"c:\classroom\hr.db")

In [3]:
df = pd.read_sql("select * from employees",con)

In [4]:
df

   id         fullname    job   salary
0   1  Stephen Walther   SPRO  1000000
1   2     Jason Hunter    DBA  1500000
2   3      Joe Stagner  SPROG  1300000
3   4       Bob Tabour     TL  2500000
4   5    Jessy Liberty   PROG   500000
5   6     James Miller    DBA  1200000
6   8       Larry Page    CEO  3000000
7   9     Jason Hunter    CTO  2000000
8  10       Bob Tabour    CFO  2000000
9  11     Rama Velpuri         2500000

In [5]:
df['hra'] = df.salary * 0.30

In [6]:
df

   id         fullname    job   salary       hra
0   1  Stephen Walther   SPRO  1000000  300000.0
1   2     Jason Hunter    DBA  1500000  450000.0
2   3      Joe Stagner  SPROG  1300000  390000.0
3   4       Bob Tabour     TL  2500000  750000.0
4   5    Jessy Liberty   PROG   500000  150000.0
5   6     James Miller    DBA  1200000  360000.0
6   8       Larry Page    CEO  3000000  900000.0
7   9     Jason Hunter    CTO  2000000  600000.0
8  10       Bob Tabour    CFO  2000000  600000.0
9  11     Rama Velpuri         2500000  750000.0

In [8]:
df.groupby('job')['salary'].median()

job
         2500000
CEO      3000000
CFO      2000000
CTO      2000000
DBA      1350000
PROG      500000
SPRO     1000000
SPROG    1300000
TL       2500000
Name: salary, dtype: int64

In [9]:
cur = con.cursor()
cur.execute("drop table hra_employees")
df.to_sql("hra_employees",con, index=False)

### Excel Sheet

In [11]:
df.to_excel(r"c:\classroom\hr.xlsx", sheet_name="employees", index=False)